# 1. ქვიზი 

print("რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (ავედუკი) ფუნქციონირებს დღესაც?")
print("სავარაუდო პასუხევბი:")
print("1. შუმერთა")
print("2. სელჩუკთა")
print("3. რომის")
print("4. მონღოლთა")

answer = input("პასუხი: ")

if answer.lower() == "რომის" or answer == "3":
    print("სწორია!")
else:
    print("არა! სწორი პასუხია - რომის!")

###############################################
# 2. ონლაინ მაღაზია - შესაძლოა, elif-იც გამომეყენებინა უშუალოდ პროდუქტების ჩამოთვლისას, მაგრამ მაღაზიის თვალსაზრისით რადგან შევხედე სიტუაციას, ასე უფრო პრაქტიკული იქნებოდა.

print("აირჩიეთ კატეგორია:")
print("1. მობილურები")
print("2. ტაბები")
print("3. ლეპტოპები")

answer = input("აირჩიეთ კატეგორია: ")
if answer.lower() == "მობილურები" or answer == "1":
    budget = int(input("რა არის თქვენი ბიუჯეტის მაქსიმუმი?: "))
    if budget < 339:
        print("ბოდიში, ამ თანხაში არ გვაქვს პროდუქტი")
    if budget >= 339:
        print("samsung galaxy a04s - 339₾")
    if budget >= 439:
        print("xiamo redmi 13 c - 439₾")
    if budget >= 599:
        print("Samsung galaxy a24 - 599₾")
    if budget >= 900:
        print("xiaomi poco x5 - 679₾")
    if budget >= 799:
        print("samsung galaxy s10e - 799₾")
    if budget >= 829:
        print("samsung galaxy a34 - 829₾")
    if budget >= 1199:
        print("xiaomi poco f5 - 1199₾")
    if budget >= 1699:
        print("samsung galaxy s22 - 1699₾")
    if budget >= 1949:
        print("apple iphone 13 - 1949₾")
if answer.lower() == "ტაბები" or answer == "2":
    budget = int(input("რა არის თქვენი ბიუჯეტის მაქსიმუმი?: "))
    if budget < 349:
        print("ბოდიში, ამ თანხაში არ გვაქვს პროდუქტი")
    if budget >= 349:
        print("Samsung sm-t225 - 349₾")
    if budget >= 599:
        print("realme pad 10.4 inch - 599₾")
    if budget >= 799:
        print("lenovo tab m10 plus - 799₾")
    if budget >= 949:
        print("apple ipad 2021 - 949₾")
    if budget >= 2299:
        print("samsung sm-x710 - 2299₾")
if answer.lower() == "ლეპტოპები" or answer == "3":
    budget = int(input("რა არის თქვენი ბიუჯეტის მაქსიმუმი?: "))
    if budget < 399:
        print("ბოდიში, ამ თანხაში არ გვაქვს პროდუქტი")
    if budget >= 399:
        print("Acer Travelmate - 399₾")
    if budget >= 599:
        print("Acer aspire 3 - 599₾")
    if budget >= 899:
        print("Asus 15 - 899₾")
    if budget >= 999:
        print("Asus vivobook go 15 - 999₾")
    if budget >= 1249:
        print("acer aspire 5 - 1249₾")

################################################
# 3. ქუესთის შედგენა

name = input("რა არის შენი პერსონაჟის სახელი?: ")

ans1 = input(f"""
ხარ ძლიერი ჯადოქარი, რომელიც სამეფომ იმ ციხე-კოშკის შესასწავლად გააგზავნა, რომელიც სამეფოს ტყეში არსაიდან გაჩნდა. რამდენიმე საათიანი მგზავრობის დროს ჭორად მოისმინე, რომ კოშკში შეუხედავი მონსტერბი სახლობენ და მახლობლად დასახლებას ატერორებენ. ტყეში შესვლიდან მალევე სწორედ ამ კოშკის შესასვლელს მიადექი. ხედავ ხის მასიურ ჭიშკარს, რომელიც კოშკის მთავარი შესასვლელი უნდა იყოს.
{name}, რას მოიმოქმედებ?
1. კარზე დავაკაკუნებ.
2. კარს ავაფეთქებ.
3. შელოცვით შევამოწმებ კოშკს.
""")
if ans1 == "კარზე დავაკაკუნებ" or "1":
        ans1_1 = input("""
        მიდიხარ კართან და შენი გრძელი ხის კვერთხით აკაკუნებ, ხმა ექოდ ედება ციხე-კოშკს. რამდენიმე წამის შემდეგ გესმის აბჯრის ჟღარუნის ხმა, რომელიც ნელ-ნელა უფრო იმატებს.
        რას მოიმოქმედებ?
        1. კარს ავაფეთქებ.
        2. დავიმალები.
        3. გამოვიყენებ გაუჩინარების შელოცვას.
        """)
        if ans1_1 == "1" or "კარს ავაფეთქებ":
            ans1_1_1 = input("""
            კვერთხის ბოლოში კრისტალი წითლად ნათდება, კარისკენ გაშვერის შემდეგ კი ცეცხლის ბურთს ტყორცნი. ბურთი კარს ხვდება, ხმაურით აფეთქებს და ხის კარს ნაწილებად შლის. ხედავ, რომ შიგნით შემტვრეული კარი იქვე მდგომ ორ არსებას ეცემა. გამოჩნდა დერეფანი, რომლის ბოლოშიც ქვის კიბეა. სავარაუდოდ აფეთქების ხმაურის გამო ყურადღება მიიქციე და ახლა სხვა მრავალი აბჯრის ხმა გესმის.
            რას მოიმოქმედებ?
            1. გავიქცევი და კიბეზე ავირბენ.
            2. კიდევ ვისვრი ცეცხლის ბურთს.
            """)
            if ans1_1_1 == "1" or "გავიქცევი და კიბეზე ავირბენ":
                ans1_1_1_1 = input("""
                შელოცვას იყენებ და ადგილიდან წამის უსწრაფესად წყდები. მალევე იმ ქვის კიბეების შუაში დგახარ, რომელიც ცოტა ხნის წინ შეამცნიე. ზემოთ თვალუწვდენელ კიბეებს ხედავ, რომლებიც კოშკს მიუყვება, ბევრგან არის თაღი და კარი, რომლებიც სავარაუდოდ დერეფნებსა თუ ოთახებში მიუძღვება სტუმარს. ზედა სართულებიდან ხმაური შემოგესმა, როგორც ჩანს, კარის აფეთქება შეუმჩნეველი არ დარცენილა.
                რას მოიმოქმედებ?
                1. კიბეზე ავირბენ და სამალავს ვიპოვი.
                2. ცხოველად გადავიქცევი.
                3. გაუჩინარდები და კედელთან დაიმალები.
                """)
            elif ans1_1_1 == "2" or "კიდევ ვისვრი ცეცხლის ბურთს":
                ans1_1_1_2 = input("""
                ელოდები, როდის გამოჩნდებიან აბჯრიანი ორკები კიბეებზე და კიდევ ერთ ცეცხლის ბურთს ისვრი. აფეთქების სიმძლავრე საშინელ არეულობას იწვევს და ციხე-კოშკს აზანზარებს. ზედა სართულებიდან ამოუცნობი, საზარელი, მხეცის გულიდან ამოსული ღრიალი მოგესმა.
                რას მოიმოქმედებ?
                1. ცხოველად გადაიქცევი.
                2. გამოიყენებ სისწრაფის შელოცვას და სწორედ ამ საზარელი მხეცისკენ გაეშურები.
                3. სასწრაფოდ დატოვებ ტერიტორიას და სამეფოში დაბრუნდები.
                """)
        elif ans1_1 == "2" or "დავიმალები":
            ans1_1_2 = input("""
        იქვე მდგარ მსხვილძირიან ხეს ეფარები. ხედავ, როგორ იხსნება მასიური კარი და გარეთ მაღალი, აბჯარ-ასხმული ორკი გამოდის, რომელსაც მეორეც მოჰყვება. ხედავ, როგორ ათამაშებს ერთ-ერთი მათგანი თავის დინგს აქეთ-იქით "ადამიანი... ადამიანის სუნია..." ბუტბუტებს მალევე. "სხვებს უნდა გავაგებინოთ".
        რას მოიმოქმედებ?
        1. ვესვრი ცეცხლის ბურთს.
        2. გამოვიყენებ დაძინების შელოცვას ორკებზე.
        3. გადავიქცევი ცხოველად.
            """)
        elif ans1_1 == "3" or "გამოვიყენებ გაუჩინარების შელოცვას":
            ans1_1_3 = input("""
        კვერთხის ბოლოში კრისტალი თეთრად ნათდება, სწორედ კრისტალიდან მოყოლებული, ჯერ კვერთხის ნაწილი, შემდგომ შენი ხელი, ტანი და საბოლოოდ, მთლიანი სხეული უჩინარდება. შენგან ორიოდე მეტრში დიდი კარიბჭე იხსნება და გარეთ მაღალი, აბჯარ-ასხმული ორკი გამოდის, რომელსაც მეორეც მოჰყვება. ხედავ, როგორ ათამაშებს ერთ-ერთი მათგანი თავის დინგს აქეთ-იქით "ადამიანი... ადამიანის სუნია..." ბუტბუტებს მალევე. "სადღაც ახლოსაა. სხვებს უნდა გავაგებინოთ".
        რას მოიმოქმედებ?
        1. შევეცდები, მათ შორის გავრძვრე და კოშკში შევაღწიო.
        2. ადგილზე გაუნძრევლად დავრჩები და დაველოდები.
        3. გამოვიყენებ დაძინების შელოცვას.
            """)
elif ans1 == "კარს ავაფეთქებ" or "2":
        ans1_2 = input("""
            კვერთხის ბოლოში კრისტალი წითლად ნათდება, კარისკენ გაშვერის შემდეგ კი ცეცხლის ბურთს ტყორცნი. ბურთი კარს ხვდება, ხმაურით აფეთქებს და ხის კარს ნაწილებად შლის. ხედავ, რომ შიგნით შემტვრეული კარი იქვე მდგომ ორ არსებას ეცემა. გამოჩნდა დერეფანი, რომლის ბოლოშიც ქვის კიბეა. სავარაუდოდ აფეთქების ხმაურის გამო ყურადღება მიიქციე და ახლა სხვა მრავალი აბჯრის ხმა გესმის.
        რას მოიმოქმედებ?
        1. გავიქცევი და კიბეზე ავირბენ.
        2. კიდევ ვისვრი ცეცხლის ბურთს.
        """)
        if ans1_2 == "1" or "გავიქცევი და კიბეზე ავირბენ":
            ans1_2_1 = input("""
            შელოცვას იყენებ და ადგილიდან წამის უსწრაფესად წყდები. მალევე იმ ქვის კიბეების შუაში დგახარ, რომელიც ცოტა ხნის წინ შეამცნიე. ზემოთ თვალუწვდენელ კიბეებს ხედავ, რომლებიც კოშკს მიუყვება, ბევრგან არის თაღი და კარი, რომლებიც სავარაუდოდ დერეფნებსა თუ ოთახებში მიუძღვება სტუმარს. ზედა სართულებიდან ხმაური შემოგესმა, როგორც ჩანს, კარის აფეთქება შეუმჩნეველი არ დარცენილა.
            რას მოიმოქმედებ?
            1. კიბეზე ავირბენ და სამალავს ვიპოვი.
            2. ცხოველად გადავიქცევი.
            3. გაუჩინარდები და კედელთან დაიმალები.
            """)
        elif ans1_2 == "2" or "კიდევ ვისვრი ცეცხლის ბურთს":
            ans1_2_2 = input("""
            ელოდები, როდის გამოჩნდებიან აბჯრიანი ორკები კიბეებზე და კიდევ ერთ ცეცხლის ბურთს ისვრი. აფეთქების სიმძლავრე საშინელ არეულობას იწვევს და ციხე-კოშკს აზანზარებს. ზედა სართულებიდან ამოუცნობი, საზარელი, მხეცის გულიდან ამოსული ღრიალი მოგესმა.
            რას მოიმოქმედებ?
            1. ცხოველად გადავიქცევი.
            2. გამოვიყენებ სისწრაფის შელოცვას და სწორედ ამ საზარელი მხეცისკენ გავეშურები.
            3. სასწრაფოდ დავტოვებ ტერიტორიას და სამეფოში დაბრუნდები.
            """)
elif ans1 == "შელოცვით შევამოწმებ კოშკს" or "3":
    ans1_3 = input("""
    კვერთხის ბოლოში კრისტალი ლურჯად ნათდება, მხოლოდ შენ ხედავ, თითქოს როგორ უჩინარდება კედლები და იყურები მათ გასწვრივ. ხედავ კარის უკან მდგარ ორ აბჯარ-ასხმულ ორკს. კარის იქეთ გრძელი დარბაზია, რომლის ბოლოშიც გაშლილი ქვის კიბეებია. კიბე ორ მხარეს იშლება. თითო კედლის იქეთ ვეღარაფერს ხედავ.
    რას მოიმოქმედებ?
    1. გამოვიყენებ დაძინების შელოცვას მცველებზე და შიგნით შევიპარები.
    2. ვტელეპორტირდები კიბეებზე.
    3. გადავიქცევი ცხოველად.
    """)
    if ans1_3 == "1" or "გამოვიყენებ დაძინების შელოცვას":
        ans1_3_1 = input("""
        შენთვის რაღაცას ბურტყუნებ და ხელს ორკებისკენ იწვდი. იისფერი კვამლით ეტაპობრივად იჟღინთება ჰაერის ყოველი მომდევნო ფენა იქამდე, სანამ ორკების ფილტვებამდე არ მიაღწევს. მათი სხეულები, თითქოს მოჯადოებულიაო, ნელ-ნელა ეშვებიან ძირს. ორიოდე წამში ფშვინვის ხმაც გესმის.
        რას მოიმოქმედებ?
        1. ვტელეპორტირდები კიბეებზე.
        2. ვტელეპორტირდები ჭიშკრის შიგნით.
        3. გადავიქცევი ცხოველად.
        """)
    elif ans1_3 == "2" or "ვტელეპორტირდები კიბეებზე":
        ans1_3_2 = input("""
        თვალს ხუჭავ და ნიავის ხმაზე ადგილიდან ქრები. იმავე წამს კიბის შუაგულში ჩნდები. ზემოთ თვალუწვდენელ კიბეებს ხედავ, რომლებიც კოშკს მიუყვება, ბევრგან არის თაღი და კარი, რომლებიც სავარაუდოდ დერეფნებსა თუ ოთახებში მიუძღვება სტუმარს. ადგილის დათვალიერების დროს საშინელი ღრიალი გესმის - "ა დ ა მ ი ა ნ ი"
        
        """)

# თავდაპირველად მინდოდა რამდენიმე არჩევანი მომეცა დასაწყისში პერსონაჟისთვის. მაგალითად, რასისა და კლასის 3-3 ტიპი (ადამიანი, ელფი, ჯუჯა; ჯადოქარი, მშვილდოსანი, მებრძოლი), მაგრამ წერა რომ დავიწყე, მივხვდი, ვერანაირ ლოგიკურ დროში ვერ ჩავეტეოდი. შემდეგ გადავწყივტე ერთ კონკრეტულზე ფოკუსირება, მაგრამ აშკარაა, ესეც ვერ მივიყვანე ბოლომდე. რაც მთავარია, მთავარ კონცეფციას ჩავწვდი. ინტრიგაში რომ არ დარჩეთ, გეტყვით, რომ მონსტრი რაღაც სახის ვამპირის მსგავსი არსება უნდა იყოს, რომელიც 80% შემთხვევაში კლავს პერსონაჟს. გადარჩენის შანის გაქცევაა. სხვა შემთხვევაში კი, როცა ცხოველად გადაიქცეოდა, უფრო კონკრეტულად, რაიმე მფრინავად, შორიდან მაგიური შეტევა, რაც ასევე, ნაკლებად სავარაუდოა და შედეგი მაინც სიკვდილი იქნებოდა.
# P.s. დეკემბრის განმავლობაში ნაკლებად აქტიური ვიქნები, სამსახურიდან მიწევს ხოლმე დასწრება და ახლაც ამ კოდს სამსახურში ვწერ. სწორედ დროის უქონლობის გამო ვერ დავასრულებ კოდს ნორმალურად, შესაბამისად მიწევს აქ გაწყვეტა. ახალი წლის შემდეგ სამსახურიდან მოვდივარ და შედარებით მეტი დრო მექნება.