intro = "ხარ გამოცდილი ჯადოქარი, რომელიც მეფისთვის მუშაობს. ცხოვრეbაში ბევრი საინტერესო რამ გადაგხდენია თავს. მთელი სამეფო განსხვავებული სახელით გიცნობს და რეალური სახელი მხოლოდ რამდენიმე არსებამ იცის. რა არის შენი რეალური სახელი?"





starting = "თავის ტკივილი გაღვიძებს. თვალების გახელისას ჩაბნელებულ დილეგს ხედავ, ბინძური, ნახევრად დატბორილი იატაკითა და ხის კარით. კუთხეში იატაკზე ზიხარ და ბევრს ვერაფერს ამჩნევ. შელოცვების წიგნი თან არ გაქვს. როგორ მოიქცევი? 1. დავათვალიერებ დილეგს, იქნებ რამე ვიპოვო; 2. შევეცდები რამის გახსენებას; 3. დავიწყებ ყვირილს, იქნებ ვინმემ გაიგოს;"

a1 = "დილეგში ბევრი არაფერია, მაგრამ ერთ-ერთი ქვის ქვემოთ იპოვე რკინის გასაღები. როგორ მოიქცევი? 1. ვცდი კარის გაღებას გასაღებით; 2. შევეცდები, ყური დავუგდო, იქნებ რამე გავიგო; 3. შევეცდები, დილეგში სხვა რამეც ვიპოვო."

a2 = "გონებას ძაბავ, ბოლო რაც გახსენდება არის მისია, რომელზე წასვლასაც გეგმავდი, მაგრამ მისიის დეტალებს ვერ იხსენებ. გონებაში თითქოს ბურუსი გაქვს, რომლის უკანაც უზარმაზარ სასახლეს ხედავ. როგორ მოიქცევი? 1. დავათვალიერებ დილეგს, იქნებ რამე ვიპოვო; 2. დავიწყებ ყვირილს, იქნებ ვინმემ გაიგოს; 3. "

a3 = "ხმამაღლა ყვირი, რამდენიმე წამში ექო უკან გიბრუნდება. გესმის, როგორ ედება შენი ხმა ქვის კედლებს და სადღაც უსასრულობაში იკარგება, საპასუხოდ არაფერი გაგიგია. ერთადერთი, რამდენიმე წამის შემდეგ კედელთან, ოთახის ბნელ მხარეს, ორი პატარა თაგვი შენიშნე, რომელიც შენი ყვირილის გამო შეშინდნენ და ადგილიდან ვერ ინძრეოდნენ. როგორ მოიქცევი? 1. დავათვალიერებ დილეგს, იქნებ რამე ვიპოვო; 2. შევეცდები რამის გახსენებას;"





a1_1 = "საკეტში გასაღებს გაჭირვებით ათავსებ, მაგრამ სანამ გადაატრიალებ, კარი იქამდე იღება შენს მოქაჩვაზე. გასაღები აშკარად არაა ამ კარის, მას ჯიბეში ინახავ. გარეთ გზები მარჯვნივ და მარცხნივ მიდის, ორივე მხარეს მოსახვევებია, კედლებს მსგავსი დილეგის კარებები მიუყვება, როგორც შენს შემთხვევაში. როგორ მოიქცევი? 1. მარჯვენა გზა გავუყვები, საიდანაც სინათლე მოჩანს; 2. მარცხენა მხარეს გავუყვები, საითაც მეტი სიბნელეა; 3. სხვა დილეგებს შევამოწმებ;"

a1_2 = "ფოკუსირება გიჭირს, თავი ისევ გტკივა. თვალებს ხუჭავ და გონების ბურუსშინ ათლად წარმოგიდგება ვირთხების ბრბო მათი წრუწუნის გაგებაზე, წყლის წვეთების ხმა და სადღაც შორიდან მომავალი ყვავის ჩხავილი. როგორ მოიქცევი? 1. ვცდი კარის გაღებას გასაღებით; 2. შევეცდები, დილეგში სხვა რამეც ვიპოვო;"

a1_3 = "იატაკის ერთ-ერთ დატბორილ სეგმენტში ძებნისას პოულობ თაგვის ძვლებს და თავისქალას, რომელიც რომელიმე დიდი ზომის ჰუმანოიდ არსებას ეკუთვნის დიდი ეშვებით. როგორ მოიქცევი? 1. ვცდი კარის გაღებას გასაღებით; 2. შევეცდები, ყური დავუგდო, იქნებ რამე გავიგო;"





a1_1_1 = "გვერდი აუარე ჩაკეტილ დილეგებს და მოსახვევში გახვედი, პირდაპირ ღია კარს ხედავ, საიდანაც შუქი გამოდის. შიგნით აშკარად ცეცხლი ანთია, შეშის ტკაცუნის ხმაც გაიგე, მაგრამ მეტია რაფერი ისმის. შიგნით შეხვედი, ოთახს მეორე გასასვლელიც აქვს, რომელიც მსგავს დერეფანში გადის, მაგრამ კარი ჩაკეტილია. ოთახში დგას მაგიდა და სკამები, კედლებზეც რაღაცები კიდია. რას იზამ? 1. ოთახს გავჩხრეკ; 2. ბუხართან გავთბები; 3. ჩემს უკან კარს მოვხურავ;"

a1_1_2 = "გზას მარცხნივ მიუყვები. რამდენიმე დილეგის კარის გავლის შემდეგ მოსახვევი გხვდება. ამ მხარეს 1 ჩაკეტილი კარია და ნაგავია - ჩიხში აღმოჩნდი. როგორ მოიქცევი? 1. მარჯვენა გზა გავუყვები, საიდანაც სინათლე მოჩანს; 2. სხვა დილეგებს შევამოწმებ;"

a1_1_3 = "ერთი დილეგის კარს მიადექი, გაღება სცადე, მაგრამ უშედეგოდ. შემდეგ მეორე, მესამე... არცერთი კარი არ იღება, არც რაიმე ხმა გესმის მეორე მხრიდან. როგორ მოიქცევი? 1. მარჯვენა გზა გავუყვები, საიდანაც სინათლე მოჩანს; 2. მარცხენა მხარეს გავუყვები, საითაც მეტი სიბნელეა;"





a1_1_1_1 = "ოთახის კარგად დათვალიერების შემდეგ რამდენიმე რამ იპოვე: ხმალი და მშვილდი, რომლებიც კედლებზე კიდია, შელოცვების წიგნი, რომელიც უჯრაში იპოვე. რომელს აიღებ? 1. შელოცვების წიგნს; 2. ხმალს; 3. მშვილდს;"

a1_1_1_2 = "მიხვედი ოთახის კედელში ჩაშენებულ ბუხარში, რომელშიც ცეცხლი აქტიურად გიზგიზებს. მალევე შეამჩნიე, რომ ცეცხლი არა მაგიურია (როგორც ეს უმეტეს ადგილას), არამედ რეალური შეშა იწვის, რაც შენთვის გასაკვირია. როგორ მოიქცევი? 1. ოთახს გავჩხრეკ; 2. ჩემს უკან კარს მოვხურავ;"

a1_1_1_3 = "მასიური რკინის კარი ძლივს დაძარი, მაგრამ დახურე, ის შიგნიდან ჩაკეტე ურდულით. ახლა როგორ მოიქცევი? 1. ოთახს გავჩხრეკ; 2. ბუხართან გავთბები;"





a1_1_1_1_1 = "შელოცვების წიგნი აიღე და გადაშალე. მეორე გვერდზევე აფეთქების შელოცვა შეგხვდა. ახლა როგორ მოიქცევი? 1. რამენაირად გასასვლელი კარის გახსნას ვცდი; 2. გასასვლელ კარს შელოცვით ავაფეთქებ; 3. შელოცვების წიგნს დავათვალიერებ;"

a1_1_1_1_2 = "მიხვედი კედელთან, რომელზეც ხმალი კიდია. აღებას ეცადე, მაგრამ მალევე გაგივარდა - ხმალი იმაზე გაცილებით მძიმეა, ვიდრე საშუალო სტატისტიკური ხმლები, ივარაუდე, რომ მხოლოდ დეკორატიული მიზნებისთვის არის გათვლილი. დარჩენილიდან რომელს აიღებ? 1. შელოცვების წიგნს; 2. მშვილდს;"

a1_1_1_1_3 = "მშვილდი აიღე, მაგრამ ცუდ მდგომარეობაში დაგხვდა - გაწყვეტილი სიმით ნამდვილად ვერ გამოიყენებდი. დანარჩენი იარაღებიდან რომელს აიღებ? 1. შელოცვების წიგნს; 2. ხმალს;"





a1_1_1_1_1_1 = "კარს მიადექი. წინა კარის მსგავსად ღია არ აღმოჩნდა. დაკვირვებით მალევე შეამჩნიე, რომ კარს რაღაც შელოცვა ედო, რომელიც მის უსაფრთხოებას უზრუნველყოფდა. შემდეგ ყურადღება საკეტზე გადაიტანე და მალევე შეამჩნიე, რომ დასაწყისში ნაპოვნი გასაღები კარს ზუსტად უნდა მოერგოს და ასეც აღმოჩნდა. შედეგად შენ გააღწიე პირველი დილეგიდან *დრო* წუთში. მაგრამ აშკარად ხვედბი, რომ ეს ყოველივე მხოლოდ დასაწყისია და წინ დიდი გზა გაქვს გასავლელი."

a1_1_1_1_1_2 = "კარისგან შორს გამოიწიე, წიგნი ერთ ხელში დაიკავე, მეორე ხელი საკეტს მიუშვირე და შელოცვის სიტყვები წარმოთქვი *ბამ* აფეთქების ხმა მღელს კონსტრუქციას მოედო, ექო რამდენჯერმე დაგიბრუნდა უკან. ამის მიუხედავად, კარი სიევ ისეთი სიმყარით იდგა და ნაკაწრიც არ ჰქონდა. რას მოიმოქმედებ? 1. რამენაირად გასასვლელი კარის გახსნას ვცდი; 2. შელოცვების წიგნს დავათვალიერებ."

a1_1_1_1_1_3 = "წიგნის გვერდები გადაფურცლე. ბევრი გვერდი თითქოს შეწებებულივით არის ერთმანეთთან, არადა აშკარად ჩანს, რომ მათზე სხვადასხვა ინფორმაცია წერია. სამაგიეროთ, ისეთ გვერდებზე, რომლებიც დაწებებული არაა, ნაცნობი შელოცვები შეგხვდა, მაგრამ ამ სიტუაციაში გამოსაყენებელი არაფერი. როგორ მოიქცევი? 1. რამენაირად გასასვლელი კარის გახსნას ვცდი; 2. გასასვლელ კარს შელოცვით ავაფეთქებ;"